In [6]:
import pandas as pd

In [7]:
# The employee asset has basic information about the employee and which department
# they were in each year.
def employee():
    df = pd.read_csv('data/employee.csv')
    return df


# The salary asset has the compensation information for each employee by year
def salary():
    df = pd.read_csv('data/salary.csv')
    return df

In [8]:
e = employee()
s = salary()

In [9]:
pd.merge(s, e, on = ['employee_id','year'])

   employee_id  year  salary    department
0        GB028  2021  187300       Product
1        GB028  2022  187500       Product
2        GB028  2023  193450         Sales
3        AK712  2021  123100  Data Science
4        AK712  2022  123700  Data Science
5        AK712  2023  187200       Product
6        LH412  2021   94000         Sales
7        LH412  2022   98000         Sales
8        LH412  2023   98500         Sales
9        KK233  2021  103400       Product
10       KK233  2022  104300  Data Science
11       KK233  2023  105500       Product

In [10]:
pd.merge(s, e, on = ['employee_id','year']).groupby(['department','year'])['salary'].sum()

department    year
Data Science  2021    123100
              2022    228000
Product       2021    290700
              2022    187500
              2023    292700
Sales         2021     94000
              2022     98000
              2023    291950
Name: salary, dtype: int64

In [11]:
df = pd.DataFrame(pd.merge(s, e, on = ['employee_id','year']).groupby(['department','year'])['salary'].sum())

In [12]:
df

                   salary
department   year
Data Science 2021  123100
             2022  228000
Product      2021  290700
             2022  187500
             2023  292700
Sales        2021   94000
             2022   98000
             2023  291950

In [13]:
df.to_csv('output/summary_demo.csv')